package epam.Training_Java_Epam.Basics_of_software_code_development.Cycles.Task6;

/*
6. Вывести на экран соответствий между символами и их численными обозначениями в памяти компьютера.
 */

public class Task6 {

    public static void main(String[] args) {

        for (int i=0;i<=255;i++)
        {
            System.out.println((char)i);
        }

    }
}
